MayRGSilva/ufcg-iiot-predictive-management-stm32/L4_IOT_Sensors/Core/Src/main.c
/* USER CODE BEGIN Header */
/**
 ******************************************************************************
 * @file           : main.c
 * @brief          : Main program body
 ******************************************************************************
 * @attention
 *
 * Copyright (c) 2022 STMicroelectronics.
 * All rights reserved.
 *
 * This software is licensed under terms that can be found in the LICENSE file
 * in the root directory of this software component.
 * If no LICENSE file comes with this software, it is provided AS-IS.
 *
 ******************************************************************************
 */
/* USER CODE END Header */
/* Includes ------------------------------------------------------------------*/
#include "main.h"

/* Private includes ----------------------------------------------------------*/
/* USER CODE BEGIN Includes */

// Display oled I2C
#include "ssd1306.h"
#include "ssd1306_tests.h"

// Drivers
#include "stm32l475e_iot01.h"
#include <math.h>
#include <stdio.h>
#include "stdbool.h"

// Temperature sensor
#include "stm32l475e_iot01_tsensor.h"

// Accelerometer sensor
#include "stm32l475e_iot01_accelero.h"

// valor rms
#include "valorRMS.h"

/* USER CODE END Includes */

/* Private typedef -----------------------------------------------------------*/
/* USER CODE BEGIN PTD */

/* USER CODE END PTD */

/* Private define ------------------------------------------------------------*/
/* USER CODE BEGIN PD */
/* USER CODE END PD */

/* Private macro -------------------------------------------------------------*/
/* USER CODE BEGIN PM */

/* USER CODE END PM */

/* Private variables ---------------------------------------------------------*/
DFSDM_Channel_HandleTypeDef hdfsdm1_channel1;

I2C_HandleTypeDef hi2c1;
I2C_HandleTypeDef hi2c2;

QSPI_HandleTypeDef hqspi;

SPI_HandleTypeDef hspi3;

UART_HandleTypeDef huart1;
UART_HandleTypeDef huart2;
UART_HandleTypeDef huart3;

PCD_HandleTypeDef hpcd_USB_OTG_FS;

/* USER CODE BEGIN PV */

// Temperature sensor
float temp_value = 0;   // Measured temperature value
char str_tmp[100] = ""; // Formatted message to display the temperature value
char str_tmp2[100] = "";
char min_temp[10] = "";
char max_temp[10] = "";
char min_acx[10] = "";
char max_acx[10] = "";
char min_acy[10] = "";
char max_acy[10] = "";
char min_acz[10] = "";
char max_acz[10] = "";
char str_acx[100] = "";
char str_acy[100] = "";
char str_acz[100] = "";
uint8_t msg1[] = "****** Temperature values measurement ******\n\n\r";
uint8_t msg2[] = "=====> Initialize Temperature sensor HTS221 \r\n";
uint8_t msg3[] = "=====> Temperature sensor HTS221 initialized \r\n ";

// Accelerometer sensor
int16_t acelerometer_value[3] = {0}; // Measured gyroscope value
char str_acel1[100] = "";            // Formatted message to display the gyroscope value
char str_acel2[100] = "";            // Formatted message to display the gyroscope value
char str_acel3[100] = "";            // Formatted message to display the gyroscope value
uint8_t msg7[] = "****** Acelerometer values measurement ******\n\n\r";
uint8_t msg8[] = "=====> Initialize Acelerometer sensor HTS221 \r\n";
uint8_t msg9[] = "=====> Acelerometer sensor LSM6DSL initialized \r\n ";

// Interruptions

bool flag = false;
/* USER CODE END PV */

/* Private function prototypes -----------------------------------------------*/
void SystemClock_Config(void);
static void MX_GPIO_Init(void);
static void MX_DFSDM1_Init(void);
static void MX_QUADSPI_Init(void);
static void MX_SPI3_Init(void);
static void MX_USART3_UART_Init(void);
static void MX_USB_OTG_FS_PCD_Init(void);
static void MX_I2C1_Init(void);
static void MX_USART1_UART_Init(void);
static void MX_I2C2_Init(void);
static void MX_USART2_UART_Init(void);
/* USER CODE BEGIN PFP */

/* USER CODE END PFP */

/* Private user code ---------------------------------------------------------*/
/* USER CODE BEGIN 0 */

/* USER CODE END 0 */

/**
  * @brief  The application entry point.
  * @retval int
  */
int main(void)
{
  /* USER CODE BEGIN 1 */

  /* USER CODE END 1 */

  /* MCU Configuration--------------------------------------------------------*/

  /* Reset of all peripherals, Initializes the Flash interface and the Systick. */
  HAL_Init();

  /* USER CODE BEGIN Init */

  /* USER CODE END Init */

  /* Configure the system clock */
  SystemClock_Config();

  /* USER CODE BEGIN SysInit */

  /* USER CODE END SysInit */

  /* Initialize all configured peripherals */
  MX_GPIO_Init();
  MX_DFSDM1_Init();
  MX_QUADSPI_Init();
  MX_SPI3_Init();
  MX_USART3_UART_Init();
  MX_USB_OTG_FS_PCD_Init();
  MX_I2C1_Init();
  MX_USART1_UART_Init();
  MX_I2C2_Init();
  MX_USART2_UART_Init();
  /* USER CODE BEGIN 2 */

  // Temperature Sensor
  HAL_UART_Transmit(&huart1, msg1, sizeof(msg1), 1000);
  HAL_UART_Transmit(&huart1, msg2, sizeof(msg2), 1000);
  BSP_TSENSOR_Init();
  HAL_UART_Transmit(&huart1, msg3, sizeof(msg3), 1000);

  // Accelerometer Sensor
  HAL_UART_Transmit(&huart1, msg7, sizeof(msg7), 1000);
  HAL_UART_Transmit(&huart1, msg8, sizeof(msg8), 1000);
  BSP_ACCELERO_Init();
  HAL_UART_Transmit(&huart1, msg9, sizeof(msg9), 1000);

  // Display oled i2c
  ssd1306_Init();

  /* USER CODE END 2 */

  /* Infinite loop */
  /* USER CODE BEGIN WHILE */

  float buf_temp[10] = {};
  float buf_ac[3][10] = {};
  int i = 0, j = 0;
  bool fullArray1 = false, fullArray2 = false;
  float new_temp = 0;
  float new_acX = 0;
  float new_acY = 0;
  float new_acZ = 0;

  while (1)
  {
	  float min = buf_temp[0], max = buf_temp[0];

    /* USER CODE END WHILE */

    /* USER CODE BEGIN 3 */
    // InterrupÃ§Ã£o

      // Temperature Sensor
      temp_value = BSP_TSENSOR_ReadTemp();
      int tmpInt1 = temp_value;
      float tmpFrac = temp_value - tmpInt1;
      int tmpInt2 = trunc(tmpFrac * 100);
     // snprintf(str_tmp, 100, " TEMPERATURE = %d.%02d\n\r", tmpInt1, tmpInt2);
     // HAL_UART_Transmit(&huart1, (uint8_t *)str_tmp, sizeof(str_tmp), 1000);
      if (flag == false){
      // Valores em RMS
      //  Criação do buffer de temperatura

