MayRGSilva/ufcg-iiot-predictive-management-stm32/L4_IOT_Sensors/Core/Src/main.c
      buf_temp[i] = temp_value;
      //float min = buf_temp[0], max = buf_temp[0];
      i++;

      if (fullArray1)
      {
        new_temp = valorRMS(buf_temp, 10);
      }
      else
      {
        new_temp = valorRMS(buf_temp, i);
      }
      if (i == 10)
      {
        i = 0;
        fullArray1 = true;
      }
      if (buf_temp[i] > max)
      {
        max = buf_temp[i];
      }
      if (buf_temp[i] < min)
      {
        min = buf_temp[i];
      }

      int min1 = min;
      float minFrac = min - min1;
      int min2 = trunc(minFrac * 100);

      int max1 = max;
      float maxFrac = max - max1;
      int max2 = trunc(maxFrac * 100);

      snprintf(str_tmp2, 100, "RMS = %d.%02d\n\r", tmpInt1, tmpInt2);
      snprintf(min_temp, 100, "MIN = %d.%02d\n\r", min1, min2);
      snprintf(max_temp, 100, "MAX = %d.%02d\n\r", max1, max2);
      HAL_UART_Transmit(&huart1, (uint8_t *)str_tmp2, sizeof(str_tmp2), 1000);
      HAL_UART_Transmit(&huart1, (uint8_t *)min_temp, sizeof(str_tmp2), 1000);
      HAL_UART_Transmit(&huart1, (uint8_t *)max_temp, sizeof(str_tmp2), 1000);

      // Accelerometer Sensor
      BSP_ACCELERO_AccGetXYZ(acelerometer_value);// se ligar nisso aqui. acelerometer_value já é inteiro
      int acelXInt1 = acelerometer_value[0];
      float acelXFrac = acelerometer_value[0] - acelXInt1;
      int acelXInt2 = trunc(acelXFrac * 100);

      int acelYInt1 = acelerometer_value[1];
      float acelYFrac = acelerometer_value[1] - acelYInt1;
      int acelYInt2 = trunc(acelYFrac * 100);

      int acelZInt1 = acelerometer_value[2];
      float acelZFrac = acelerometer_value[2] - acelZInt1;
      int acelZInt2 = trunc(acelZFrac * 100);

      snprintf(str_acel1, 100, " ACEL_X = %d.%02d\n\r", acelXInt1, acelXInt2);
      snprintf(str_acel2, 100, " ACEL_Y = %d.%02d\n\r", acelYInt1, acelYInt2);
      snprintf(str_acel3, 100, " ACEL_Z = %d.%02d\n\n\r", acelZInt1, acelZInt2);
      HAL_UART_Transmit(&huart1, (uint8_t *)str_acel1, sizeof(str_acel1), 1000);
      HAL_UART_Transmit(&huart1, (uint8_t *)str_acel2, sizeof(str_acel2), 1000);
      HAL_UART_Transmit(&huart1, (uint8_t *)str_acel3, sizeof(str_acel3), 1000);

      // CriaÃ§Ã£o do buffer do acelerometro x,y,z

      int min_ax = buf_ac[0][j], max_ax = buf_ac[0][j];
      int min_ay = buf_ac[1][j], max_ay = buf_ac[1][j];
      int min_az = buf_ac[2][j], max_az = buf_ac[2][j];

      buf_ac[0][j] = acelerometer_value[0];
      buf_ac[1][j] = acelerometer_value[1];
      buf_ac[2][j] = acelerometer_value[2];
      j++;

      if (fullArray2)
      {
        new_acX = valorRMS(buf_ac[0], 10);
        new_acY = valorRMS(buf_ac[1], 10);
        new_acZ = valorRMS(buf_ac[2], 10);
      }
      else
      {
        new_acX = valorRMS(buf_ac[0], j);
        new_acY = valorRMS(buf_ac[1], j);
        new_acZ = valorRMS(buf_ac[2], j);
      }

      if (j == 10)
      {
        j = 0;
        fullArray2 = true;
      }

      // min-max eixo x
      if (buf_ac[0][j] > max_ax){
        max_ax = buf_ac[0][j];
      }
      if (buf_ac[0][j] < min_ax){
        min_ax = buf_ac[0][j];
      }

      snprintf(min_acx, 100, "MIN=%d\n\r", min_ax);
      snprintf(max_acx, 100, "MAX=%d\n\r",max_ax);


      // min-max eixo y
      if (buf_ac[0][j] > max_ay){
    	  max_ay = buf_ac[0][j];
      }
      if (buf_ac[0][j] < min_ay){
    	  min_ay = buf_ac[0][j];
      }

      snprintf(min_acy, 100, "MIN=%d\n\r", min_ay);
      snprintf(max_acy, 100, "MAX=%d\n\r",max_ay);

      // min-max eixo y
      if (buf_ac[0][j] > max_ay){
    	  max_az = buf_ac[0][j];
      }
      if (buf_ac[0][j] < min_ay){
         min_az = buf_ac[0][j];
      }

      snprintf(min_acz, 100, "MIN=%d\n\r", min_az);
      snprintf(max_acz, 100, "MAX=%d\n\r",max_az);

      int acx = new_acX;
      float acxFrac = acx - new_acX;
      int rmsAcx = trunc(acxFrac * 100);

      int acy = new_acY;
      float acyFrac = acy - new_acY;
      int rmsAcy = trunc(acyFrac * 100);

      int acz = new_acZ;
      float aczFrac = acx - new_acX;
      int rmsAcz = trunc(aczFrac * 100);

      snprintf(str_acx, 100, " RMS_X = %d.%02d\n\n\r", acx, rmsAcx);
      snprintf(str_acy, 100, " RMS_Y = %d.%02d\n\n\r", acy, rmsAcy);
      snprintf(str_acz, 100, " RMS_Z = %d.%02d\n\n\r", acz, rmsAcz);

      // Display oled i2c

      ssd1306_Fill(White);
      ssd1306_SetCursor(0, 10);
      ssd1306_WriteString("TEMPERATURAbla", Font_6x8, Black);
      ssd1306_SetCursor(0, 20);
      ssd1306_WriteString(str_tmp2, Font_6x8, Black);
      ssd1306_SetCursor(0, 30);
      ssd1306_WriteString(min_temp, Font_6x8, Black);
      ssd1306_SetCursor(0, 40);
      ssd1306_WriteString(max_temp, Font_6x8, Black);
      ssd1306_UpdateScreen();
      HAL_Delay(2000);

      ssd1306_Fill(White);
      ssd1306_SetCursor(0, 10);
      ssd1306_WriteString("ACELERACAO X:", Font_6x8, Black);
      ssd1306_SetCursor(0, 20);
      ssd1306_WriteString(str_acx, Font_6x8, Black);
      ssd1306_SetCursor(0, 30);
      ssd1306_WriteString(min_acx, Font_6x8, Black);
      ssd1306_SetCursor(0, 40);
      ssd1306_WriteString(max_acx, Font_6x8, Black);
      ssd1306_UpdateScreen();
      HAL_Delay(2000);

      ssd1306_Fill(White);
      ssd1306_SetCursor(0, 10);
      ssd1306_WriteString("ACELERACAO Y:", Font_6x8, Black);
      ssd1306_SetCursor(0, 20);
      ssd1306_WriteString(str_acy, Font_6x8, Black);
      ssd1306_SetCursor(0, 30);
      ssd1306_WriteString(min_acy, Font_6x8, Black);
      ssd1306_SetCursor(0, 40);
      ssd1306_WriteString(max_acy, Font_6x8, Black);
      ssd1306_UpdateScreen();
      HAL_Delay(2000);

      ssd1306_Fill(White);
      ssd1306_SetCursor(0, 10);
      ssd1306_WriteString("ACELERACAO Z:", Font_6x8, Black);
      ssd1306_SetCursor(0, 20);
      ssd1306_WriteString(str_acz, Font_6x8, Black);
      ssd1306_SetCursor(0, 30);
      ssd1306_WriteString(min_acz, Font_6x8, Black);
      ssd1306_SetCursor(0, 40);
      ssd1306_WriteString(max_acz, Font_6x8, Black);
      ssd1306_UpdateScreen();
      HAL_Delay(2000);
    }
    else
    {

